МедИнтеграция/src/Documents/ЗаказУслуги/ЗаказУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказУслуги</name>
  <registerRecords>AccumulationRegister.ВыполненныеУслуги</registerRecords>
  <registerRecords>InformationRegister.ИсторияСтатусов</registerRecords>
  <attributes>
    <name>Клиника</name>
    <type>
      <types>CatalogRef.Клиники</types>
    </type>
  </attributes>
  <attributes>
    <name>Пациент</name>
    <type>
      <types>CatalogRef.Пациенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МедИнтеграция/src/AccumulationRegisters/ВыполненныеУслуги/ВыполненныеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыполненныеУслуги</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиника</name>
    <type>
      <types>CatalogRef.Клиники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

МедИнтеграция/src/Documents/ЗаказУслуги/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВыполненныеУслуги.Записывать = Истина;
	Для Каждого Стр из Услуги Цикл
		Движение = Движения.ВыполненныеУслуги.Добавить();	
		Движение.Период      = Дата;
    	Движение.Клиника     = Клиника;
    	Движение.Услуга      = Стр.Услуга;
    	Движение.Количество  = Стр.Количество;
    	Движение.Сумма       = Стр.Сумма;
	КонецЦикла;	
		
КонецПроцедуры
